app/Models/Catlog_model.php

SELECT *
FROM `master_attributes_t`
WHERE `deleted_by` = ''
---
	public function view_master_attr()
	{
		// $result = $this->lib->view_master_Att();
		$builder = $this->db->table('master_attributes_t');
		// $builder->where('attributes_status' , '1');
		$builder->where('deleted_by', '');
		if (!empty($id)) {
			$builder->where('id', $id);
		}
		$query   = $builder->get();

SELECT *, `attributes_variations_t`.`id` as `idsget`
FROM `attributes_variations_t`
JOIN `master_attributes_t` ON `master_attributes_t`.`id`=`attributes_variations_t`.`master_attribute_id`
WHERE `attributes_variations_t`.`deleted_by` = ''
---
	public function view_att_variation()
	{
		$builder = $this->db->table('attributes_variations_t');
		$builder->join('master_attributes_t', "master_attributes_t.id=attributes_variations_t.master_attribute_id");
		$builder->where('attributes_variations_t.deleted_by', '');
		$builder->select('*,attributes_variations_t.id as idsget');
		// $builder->where('attribute_variation_status' , '1');
		if (!empty($id)) {
			$builder->where('id', $id);
		}
		$query = $builder->get();

SELECT *
FROM `attributes_variations_t`
WHERE `id` = '9'
---
	public function update_attr_variation($id)
	{
		$builder = $this->db->table('attributes_variations_t');
		if (!empty($id)) {
			$builder->where('id', $id);
		}
		$query = $builder->get();